<template>

  <section class="steps">
    <div class="_container">
      <ol class="steps-row">
        <li class="steps-card">
          <span class="steps-card-number">01</span>
          <div class="steps-card-content">
            <h3>Выберите бренд</h3>
            <p>Работаем только с крупными и надежными брендами, продукты которых нужны миллионам людей</p>
          </div>
        </li>
        <li class="steps-card">
          <span class="steps-card-number">02</span>
          <div class="steps-card-content">
            <h3>Разместите рекламу</h3>
            <p>Поделимся с вами примерами успешных публикаций, чтобы вы
              не тратили свое время</p>
          </div>
        </li>
        <li class="steps-card">
          <span class="steps-card-number">03</span>
          <div class="steps-card-content">
            <h3>Получите оплату</h3>
            <p>Оплачиваем каждого клиента
              и не ограничиваем доход с одной
              публикации</p>
          </div>
        </li>
      </ol>
      <div id="grass-right"></div>

      <div class="contacts">
        <h2 class="contacts__title">Связаться с нами</h2>
        <p class="contacts__info">
          Мы здесь, чтобы помочь!<br>
          Поможем подобрать бренд и формат поста для рекламы, чтобы заработать больше!
        </p>
        <ul class="contacts__list-links">
          <li class="contacts__item-link">
            <a href="https://t.me/lobsters_support" class="contacts__link contacts__link_tg" target="_blank">
              <svg viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M21.2998 2.87446C21.066 2.88472 20.8385 2.94978 20.6332 3.03196C20.4301 3.11359 19.2607 3.61271 17.5339 4.35102C15.807 5.08934 13.5622 6.05078 11.337 7.00415C6.88655 8.91088 2.51324 10.787 2.51324 10.787L2.54511 10.7748C2.54511 10.7748 2.28116 10.863 2.01355 11.0495C1.87974 11.1427 1.73579 11.263 1.61792 11.4385C1.50006 11.614 1.41389 11.8627 1.44636 12.1257C1.56042 13.0496 2.51792 13.3116 2.51792 13.3116L2.52167 13.3135L6.7948 14.776C6.90375 15.1395 8.09085 19.1016 8.35199 19.9407C8.4962 20.4046 8.63119 20.6722 8.77199 20.8548C8.84244 20.9461 8.91628 21.0168 8.99792 21.0685C9.03036 21.0891 9.06448 21.1045 9.09824 21.1182H9.10011C9.10426 21.12 9.10816 21.1202 9.1123 21.122L9.10105 21.1191C9.10889 21.1223 9.11663 21.1276 9.12449 21.1304C9.13972 21.1357 9.14905 21.1356 9.16855 21.1398C9.65793 21.3106 10.0629 20.9935 10.0629 20.9935L10.0798 20.9804L12.7048 18.5457L16.9648 21.8673L17.0182 21.8916C17.7639 22.2227 18.4382 22.038 18.8117 21.7341C19.1851 21.4303 19.332 21.0385 19.332 21.0385L19.3479 20.9973L22.4782 4.68196C22.5583 4.31695 22.5697 4.00144 22.4942 3.71633C22.4186 3.43123 22.2351 3.18339 22.0048 3.04602C21.7745 2.90865 21.5336 2.8642 21.2998 2.87446ZM21.3251 3.8504C21.4201 3.846 21.4904 3.85685 21.5126 3.87008C21.5348 3.88331 21.5447 3.88157 21.566 3.96196C21.5873 4.04234 21.5989 4.21166 21.5407 4.47665L21.5389 4.48227L18.4264 20.7029C18.419 20.7192 18.3541 20.8693 18.206 20.9898C18.055 21.1127 17.887 21.2086 17.441 21.0216L12.7826 17.3888L12.6514 17.2857L12.6485 17.2885L11.2554 16.2432L19.0845 7.03227C19.1446 6.96168 19.1831 6.87517 19.1951 6.78321C19.2071 6.69124 19.1923 6.59776 19.1523 6.51406C19.1123 6.43036 19.049 6.36004 18.9699 6.31158C18.8908 6.26313 18.7994 6.23862 18.7067 6.24102C18.6161 6.24337 18.528 6.27133 18.4526 6.32165L7.12386 13.8741L2.84417 12.4088C2.84417 12.4088 2.4192 12.1723 2.39886 12.0076C2.39773 11.9985 2.39271 12.0067 2.4148 11.9738C2.43688 11.941 2.49239 11.8854 2.56199 11.837C2.70117 11.74 2.86011 11.6813 2.86011 11.6813L2.87605 11.6757L2.89199 11.6691C2.89199 11.6691 7.26553 9.79297 11.7157 7.88633C13.9408 6.93302 16.1852 5.97228 17.9117 5.23415C19.6377 4.4962 20.8848 3.96504 20.9904 3.92258C21.1106 3.87444 21.2302 3.85479 21.3251 3.8504ZM16.1332 9.02165L10.196 16.007L10.1932 16.0098C10.184 16.0209 10.1752 16.0325 10.167 16.0445C10.1576 16.0574 10.1488 16.0709 10.1407 16.0848C10.1074 16.1414 10.086 16.2042 10.0779 16.2695C10.0779 16.2707 10.0779 16.272 10.0779 16.2732L9.30449 19.7513C9.29163 19.7138 9.28262 19.7 9.26886 19.6557V19.6548C9.0232 18.8654 7.90319 15.1287 7.74824 14.612L16.1332 9.02165ZM10.8664 17.1516L11.9332 17.9523L10.3657 19.4054L10.8664 17.1516Z" fill="#FFF"/>
              </svg>
              Телеграм
            </a>
          </li>
          <li class="contacts__item-link">
            <a href="mailto:account@lobsters.pro" class="contacts__link contacts__link_email">
              <svg viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M4 4H20C21.1 4 22 4.9 22 6V18C22 19.1 21.1 20 20 20H4C2.9 20 2 19.1 2 18V6C2 4.9 2.9 4 4 4Z" stroke="#FFF" stroke-linecap="round" stroke-linejoin="round"/>
                <path d="M22 6L12 13L2 6" stroke="#FFF" stroke-linecap="round" stroke-linejoin="round"/>
              </svg>
              E-mail
            </a>
          </li>
        </ul>
      </div>

    </div>
  </section>

</template>

<script>
export default {

}
</script>
